In [1]:
#Programer:Pradnya Ekad
#Collage:Keystone scholl of Engineering
#class:TE(A)
#Roll no:16

In [2]:
#pandas ->Structured data analysis
import pandas as pd
#numpy ->array operations
import numpy as np

In [3]:
#create array
num=np.array([34,12,37,67,34,15])

In [4]:
num

array([34, 12, 37, 67, 34, 15])

In [5]:
type(num)

numpy.ndarray

In [6]:
num.dtype

dtype('int32')

In [7]:
num[3]

67

In [8]:
#Series
s=pd.Series([45,12,38,75,19,36])

In [9]:
s

0    45
1    12
2    38
3    75
4    19
5    36
dtype: int64

In [10]:
type(s)

pandas.core.series.Series

In [13]:
s.size

6

In [14]:
s.shape

(6,)

In [15]:
#change index
s=pd.Series([45,12,38,75,19,36],index=range(100,106))

In [16]:
s

100    45
101    12
102    38
103    75
104    19
105    36
dtype: int64

In [17]:
s[103]

75

In [18]:
#dataframes
r=pd.Series([1,2,3,4,5])
n=pd.Series(['pradnya','saniya','gita','pranaya','pooja'])
m=pd.Series([85,82,73,71,56])

In [19]:
df=pd.DataFrame({
    "roll":r,
    "name":n,
    "marks":m
})

In [20]:
df

   roll     name  marks
0     1  pradnya     85
1     2   saniya     82
2     3     gita     73
3     4  pranaya     71
4     5    pooja     56

In [21]:
df.shape

(5, 3)

In [22]:
df.size

15

In [23]:
df.dtypes

roll      int64
name     object
marks     int64
dtype: object

In [24]:
type(df)

pandas.core.frame.DataFrame

In [25]:
df=pd.read_csv('student.csv')

In [26]:
df

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [27]:
df1=pd.read_csv('student1.csv')

In [28]:
df1

    1     anil  TE  56.77  22
0   2     amit  TE  59.77  21
1   3   aniket  BE  76.88  19
2   4  ajinkya  TE  69.66  20
3   5     asha  TE  63.28  20
4   6   ayesha  BE  49.55  20
5   7     amar  BE  65.34  19
6   8    amita  BE  68.33  23
7   9     amol  TE  56.75  20
8  10    anmol  BE  78.66  21

In [29]:
cols=['A','B','C','D','E']

In [30]:
df1=pd.read_csv('student.csv',names=cols)

In [31]:
df1

       A        B      C      D    E
0   roll     name  class  marks  age
1      1     anil     TE  56.77   22
2      2     amit     TE  59.77   21
3      3   aniket     BE  76.88   19
4      4  ajinkya     TE  69.66   20
5      5     asha     TE  63.28   20
6      6   ayesha     BE  49.55   20
7      7     amar     BE  65.34   19
8      8    amita     BE  68.33   23
9      9     amol     TE  56.75   20
10    10    anmol     BE  78.66   21

In [34]:
df3=pd.read_csv('student3.tsv')

In [35]:
df3

  roll\tname\tclass\tmarks\tage
0        1\tanil\tTE\t56.77\t22
1        2\tamit\tTE\t59.77\t21
2      3\taniket\tBE\t76.88\t19
3     4\tajinkya\tTE\t69.66\t20
4        5\tasha\tTE\t63.28\t20
5      6\tayesha\tBE\t49.55\t20
6        7\tamar\tBE\t65.34\t19
7       8\tamita\tBE\t68.33\t23
8        9\tamol\tTE\t56.75\t20
9      10\tanmol\tBE\t78.66\t21

In [36]:
df3=pd.read_csv('student3.tsv',sep='/t')
df3

C:\Users\PERFECT COMPUTER\AppData\Local\Temp\ipykernel_7444\463897617.py:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  df3=pd.read_csv('student3.tsv',sep='/t')

  roll\tname\tclass\tmarks\tage
0        1\tanil\tTE\t56.77\t22
1        2\tamit\tTE\t59.77\t21
2      3\taniket\tBE\t76.88\t19
3     4\tajinkya\tTE\t69.66\t20
4        5\tasha\tTE\t63.28\t20
5      6\tayesha\tBE\t49.55\t20
6        7\tamar\tBE\t65.34\t19
7       8\tamita\tBE\t68.33\t23
8        9\tamol\tTE\t56.75\t20
9      10\tanmol\tBE\t78.66\t21

In [37]:
#read from a link
df2=pd.read_csv('https://gist.githubusercontent.com/justimchung/9b98c69b30600a46daa6d2e827c31b56/raw/4b1f08ba9b00a2fcd3f7ced9cf9e59062f489c3a/student.csv')

In [38]:
df2

  Unnamed: 0    Name  height  weight  sex       bdate       city major
0   s1234567   Peter   175.0   70.45    1   1980/4/30     Tainan  CSIE
1   e1234567    Mary   163.0   55.00    2  1981/12/21     Taipei    EE
2   f1357689    John   180.4   80.30    1   1980/5/30     Tainan  Stat
3   e1374659   Keven   182.5   77.60    1  1980/11/19     Taipei    EE
4   s7758347    JoJo   170.3   50.30    2   1980/1/27     Taipei  CSIE
5   s1334987   Emily   168.5   53.60    2  1982/10/13  Kaohsiung  CSIE
6   e1384726  Ubuntu   177.0   68.30    1    1981/7/6  Kaohsiung    EE

In [41]:
dfx=pd.read_excel('student xlsx.xlsx')

In [42]:
dfx

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [43]:
df.shape

(10, 5)

In [44]:
df.size

50

In [46]:
df.columns

Index(['roll', 'name', 'class', 'marks', 'age'], dtype='object')

In [47]:
df.dtypes

roll       int64
name      object
class     object
marks    float64
age        int64
dtype: object

In [48]:
df.ndim

2

In [49]:
df.index

RangeIndex(start=0, stop=10, step=1)

In [50]:
df.T

,0,1,2,3,4,5,6,7,8,9
roll,1,2,3,4,5,6,7,8,9,10
name,anil,amit,aniket,ajinkya,asha,ayesha,amar,amita,amol,anmol
class,TE,TE,BE,TE,TE,BE,BE,BE,TE,BE
marks,56.77,59.77,76.88,69.66,63.28,49.55,65.34,68.33,56.75,78.66
age,22,21,19,20,20,20,19,23,20,21

In [51]:
df.head

<bound method NDFrame.head of    roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21>

In [52]:
df.head(3)

   roll    name class  marks  age
0     1    anil    TE  56.77   22
1     2    amit    TE  59.77   21
2     3  aniket    BE  76.88   19

In [53]:
df.tail()

   roll    name class  marks  age
5     6  ayesha    BE  49.55   20
6     7    amar    BE  65.34   19
7     8   amita    BE  68.33   23
8     9    amol    TE  56.75   20
9    10   anmol    BE  78.66   21

In [55]:
df.tail(3)

   roll   name class  marks  age
7     8  amita    BE  68.33   23
8     9   amol    TE  56.75   20
9    10  anmol    BE  78.66   21